# ExternalResourceSubFolder Constructor (String, String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceSubFolder Constructor (String, String)
ExternalResourceSubFolder Class See Also
---
Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public ExternalResourceSubFolder(
	string folderName,
	string iconPath
)
```

Visual Basic
---
```text
Public Sub New ( _
	folderName As String, _
	iconPath As String _
)
```

Visual C++
---
```text
public:
ExternalResourceSubFolder(
	String^ folderName,
	String^ iconPath
)
```

# ### Parameters
folderName
    Type: System..::..String Folder displayed name.
iconPath
    Type: System..::..String The path of the resource icon.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceSubFolder Class
ExternalResourceSubFolder Overload
Autodesk.Revit.DB Namespace